GinoChen113511247/113_microcomputer/4_18_NEW_sample/GLCD/stm324xg_lcd_ILI9328_wizard.c
//-------- <<< Use Configuration Wizard in Context Menu >>> -----------------*/


// <h> FSMC Memory Bank Selection
//   <o0> (1~25) FSMC Address bit for RS pin (Register Sel) <1-25>
//   <o1.26..27> NOR/PSRAM 1~4 Selection
//               <0=> NE1
//               <1=> NE2
//               <2=> NE3
//               <3=> NE4
// </h>
#define RS_bit              6
#define LCD_BASE_sel        0x6C000000
#define LCD_BASE            (LCD_BASE_sel | ((0x01UL << (RS_bit+1)) - 2))
//-------------------------------------------------------------------
// <h> Fonts selection: check to include *.C files in this project
//   <q0.0> font8.c
//   <q0.1> font12.c
//   <q0.2> font16.c
//   <q0.3> font20.c
//   <q0.4> font24.c
// </h>
//     <o1> LCD Default Font
//         <0=> font8
//         <1=> font12
//         <2=> font16
//         <3=> font20
//         <4=> font24
//
//     <o2.0..3> LCD Display Direction
//         <1=> Landscape
//         <2=> Portrait
#define __Fonts_select         0x0000001E				//0
#define __default_Font         3			//1
#define __LCD_DIRECT	         2      //2 ==> 1: LANDSCAPEそ  2: PORTRAIT
//-------------------------------------------------------------
// <e> LCD Reset Pin (default PC5)
//   <o1> Port label of LCD Reset pin
//       <0=> PORT A
//       <1=> PORT B
//       <2=> PORT C
//       <3=> PORT D
//       <4=> PORT E
//       <5=> PORT F
//       <6=> PORT G
//       <7=> PORT H
//       <8=> PORT I
//       <9=> PORT J
//       <10=>PORT K
//   <o2> (0~15)Pin number of LCD Reset pin <0-15>
// </e>
//------------------------------------------
// <h> LCD Backlight Pin (default PB0)
//   <o3> Port label of LCD Backlight pin
//       <0=> PORT A
//       <1=> PORT B
//       <2=> PORT C
//       <3=> PORT D
//       <4=> PORT E
//       <5=> PORT F
//       <6=> PORT G
//       <7=> PORT H
//       <8=> PORT I
//       <9=> PORT J
//       <10=>PORT K
//   <o4> (0~15)Pin number of LCD Backlight pin <0-15>
// </h>
#define USE_resetPIN 0		// 0
#define PNr_reset 2		// 1
#define PIN_rs	5     // 2
#define PNr_backlight 1		// 3
#define PIN_bl	15         // 4
//--------------------------------------------------------
// <h> LCD FSMC Pin in Set 1
//   <i> PD0~PD1 => FSMC D2~D3
//   <i> PD4, PD5 => FSMC NOE, NWE
//   <i> PD8~PD10 => FSMC D13~D15
//   <i> PD14~PD15 => FSMC D0~D1
//   <i> PD7 => FSMC NE1
//   <i> PD11~PD13 => FSMC A16~A18
//   <o1> Port label for FSMC Set 1
//       <0=> PORT A
//       <1=> PORT B
//       <2=> PORT C
//       <3=> PORT D
//       <4=> PORT E
//       <5=> PORT F
//       <6=> PORT G
//       <7=> PORT H
//       <8=> PORT I
//       <9=> PORT J
//       <10=>PORT K
//   <h> Pins of FSMC Set 1
//     <q1.0> pin 0 
//     <q1.1> pin 1 
//     <q1.2> pin 2 
//     <q1.3> pin 3 
//     <q1.4> pin 4 
//     <q1.5> pin 5 
//     <q1.6> pin 6 
//     <q1.7> pin 7 
//     <q1.8> pin 8 
//     <q1.9> pin 9 
//     <q1.10> pin 10 
//     <q1.11> pin 11 
//     <q1.12> pin 12 
//     <q1.13> pin 13 
//     <q1.14> pin 14 
//     <q1.15> pin 15 
//   </h>
// </h>
//--------------------------------------------------------
// <h> LCD FSMC Pin in Set 2
//   <i> PE7~PE15 ===> FSMC D4~D12
//   <i> PE2, PE3~PE6 ===> FSMC A23, A19~A22
//   <o1> Port label for FSMC Set 2
//       <0=> PORT A
//       <1=> PORT B
//       <2=> PORT C
//       <3=> PORT D
//       <4=> PORT E
//       <5=> PORT F
//       <6=> PORT G
//       <7=> PORT H
//       <8=> PORT I
//       <9=> PORT J
//       <10=>PORT K
//   <h> Pins of FSMC Set 2
//     <q3.0> pin 0 
//     <q3.1> pin 1 
//     <q3.2> pin 2 
//     <q3.3> pin 3 
//     <q3.4> pin 4 
//     <q3.5> pin 5 
//     <q3.6> pin 6 
//     <q3.7> pin 7 
//     <q3.8> pin 8 
//     <q3.9> pin 9 
//     <q3.10> pin 10 
//     <q3.11> pin 11 
//     <q3.12> pin 12 
//     <q3.13> pin 13 
//     <q3.14> pin 14 
//     <q3.15> pin 15 
//   </h>
// </h>
//--------------------------------------------------------------
// <h> LCD FSMC Pin in Set 3
//   <i> PG9~PG10, PG12 ===> FSMC NE2~NE3, NE4
//   <i> PG13~PG14 ===> FSMC A24~A25
//   <o1> Port label for FSMC Set 3
//       <0=> PORT A
//       <1=> PORT B
//       <2=> PORT C
//       <3=> PORT D
//       <4=> PORT E
//       <5=> PORT F
//       <6=> PORT G
//       <7=> PORT H
//       <8=> PORT I
//       <9=> PORT J
//       <10=>PORT K
//   <h> Pins of FSMC Set 3
//     <q5.0> pin 0 
//     <q5.1> pin 1 
//     <q5.2> pin 2 
//     <q5.3> pin 3 
//     <q5.4> pin 4 
//     <q5.5> pin 5 
//     <q5.6> pin 6 
//     <q5.7> pin 7 
//     <q5.8> pin 8 
//     <q5.9> pin 9 
//     <q5.10> pin 10 
//     <q5.11> pin 11 
//     <q5.12> pin 12 
//     <q5.13> pin 13 
//     <q5.14> pin 14 
//     <q5.15> pin 15 
//   </h>
// </h>
//------------------------------------------------------------------------
// <h> LCD FSMC Pin in Set 4
//   <i> PF0~PF5 ===> FSMC A0~A5
//   <i> PF12~PF15 ===> FSMC A6~A9
//   <o1> Port label for FSMC Set 4
//       <0=> PORT A
//       <1=> PORT B
//       <2=> PORT C
//       <3=> PORT D
//       <4=> PORT E
//       <5=> PORT F
//       <6=> PORT G
//       <7=> PORT H
//       <8=> PORT I
//       <9=> PORT J
//       <10=>PORT K
//   <h> Pins of FSMC Set 4
//     <q7.0> pin 0 
//     <q7.1> pin 1 
//     <q7.2> pin 2 
//     <q7.3> pin 3 
//     <q7.4> pin 4 
//     <q7.5> pin 5 
//     <q7.6> pin 6 
//     <q7.7> pin 7 
//     <q7.8> pin 8 
//     <q7.9> pin 9 
//     <q7.10> pin 10 
//     <q7.11> pin 11 
//     <q7.12> pin 12 
//     <q7.13> pin 13 
//     <q7.14> pin 14 
//     <q7.15> pin 15 
//   </h>
// </h>
#define PNr_FSMC_set1 0									// 0
#define PinBit_FSMC_set1 0x0006     		// 1
#define PNr_FSMC_set2 0									// 2
#define PinBit_FSMC_set2	0xFF80        // 3
#define PNr_FSMC_set3 0									// 4
#define PinBit_FSMC_set3	0x1000        // 5
#define PNr_FSMC_set4 0									// 6
#define PinBit_FSMC_set4	0xF03F        // 7
//--------------------------------------------------
// <o0> Default Text Color
//       <0xFFFF=> LCD_COLOR_WHITE
//       <0x001F=> LCD_COLOR_BLUE
//       <0xF800=> LCD_COLOR_RED
//       <0xF81F=> LCD_COLOR_MAGENTA
// <o1> Default Background Color
//       <0xFFFF=> LCD_COLOR_BLACK
//       <0x001F=> LCD_COLOR_YELLOW
//       <0xF800=> LCD_COLOR_GREEN
//       <0xF81F=> LCD_COLOR_GRAY
#define Default_TextColor   0xFFFF
#define Default_BackColor   0xFFFF
//--------------------------------------------------------------
// <q0> Show LCD device ID
#define Show_DeviceID       1
//-------------- <<< end of configuration section >>>

/* Includes ------------------------------------------------------------------*/
#include "stm324xg_lcd_sklin.h"
//#define USE_HAL_LL
#ifndef USE_HAL_LL
#include "stm32f4xx_fsmc.h"
#else
#include "stm32f4xx_ll_fsmc.h"
#endif


#ifndef Bit
#define Bit(x) 	(1ul<<x)
#endif

/** 
  * @brief LCD default font 
  */ 
#if (__default_Font == 0)
	#define LCD_DEFAULT_FONT         Font8
#endif
#if (__default_Font == 1)
	#define LCD_DEFAULT_FONT         Font12
#endif
#if (__default_Font == 2)
	#define LCD_DEFAULT_FONT         Font16
#endif
#if (__default_Font == 3)
	#define LCD_DEFAULT_FONT         Font20
#endif
#if (__default_Font == 4)
	#define LCD_DEFAULT_FONT         Font24
#endif
	
#define _fontSel   (0x01<<(__default_Font) | __Fonts_select) 
#if (_fontSel & Bit(0))
	#include ".\Fonts\font8.c"
#endif
#if (_fontSel & Bit(1))
	#include ".\Fonts\font12.c"
#endif
#if (_fontSel & Bit(2))
	#include ".\Fonts\font16.c"
#endif
#if (_fontSel & Bit(3))
	#include ".\Fonts\font20.c"
#endif
#if (_fontSel & Bit(4))
	#include ".\Fonts\font24.c"
#endif


#define ABS(X)  ((X) > 0 ? (X) : -(X))
#define MAX_POLY_CORNERS   200
#define POLY_Y(Z)          ((int32_t)((Points + Z)->X))
#define POLY_X(Z)          ((int32_t)((Points + Z)->Y))

/* Global variables to set the written text color */
typedef struct 
{ 
  uint16_t TextColor;
  uint16_t BackColor;
  sFONT    *pFont; 
}LCD_DrawPropTypeDef;

static LCD_DrawPropTypeDef DrawProp={ \
			Default_TextColor, Default_BackColor, &LCD_DEFAULT_FONT};

//*** Variables concerning FONT ************
#define	pLCD_Currentfonts DrawProp.pFont
static uint16_t wf, hf;	// font_width, font_height
static uint16_t bytes_f, bytes_wf;	// number of bytes per font, that per width line in a font
volatile uint16_t lcd_id = 0;
static void LCD_PolyLineRelativeClosed(pPoint Points, uint16_t PointCount, uint16_t Closed);

//########################################################
//########################################################
//  DRIVER 													 
//########################################################
//########################################################
#if __LCD_DIRECT==1
  #define  LANDSCAPE			1
	#define  LCD_ROW_NUM    240                //pages in ILI9341 or ILI9328
	#define  LCD_COL_NUM    320                //columns in ILI9341 or ILI9328
#else
  #define  LANDSCAPE			0
	#define  LCD_ROW_NUM    320                //pages
	#define  LCD_COL_NUM    240                //columns
#endif
	#define  LCD_PIXEL_WIDTH   (LCD_COL_NUM -1)  
	#define  LCD_PIXEL_HEIGHT  (LCD_ROW_NUM -1)  

