GinoChen113511247/113_microcomputer/4_18_NEW_sample/GLCD/stm324xg_lcd_ILI9328_wizard.c
uint16_t LCD_Pixel_Width(void){ return LCD_PIXEL_WIDTH;}
uint16_t LCD_Pixel_Height(void){ return LCD_PIXEL_HEIGHT;}

typedef struct
{
  volatile uint16_t LCD_REG;			// RS = 0
  volatile uint16_t LCD_RAM;      // RS = 1
} LCD_TypeDef;		


	GPIO_TypeDef *GPIO_backlight, *GPIO_reset;
//#define	 LCD_BASE        ((uint32_t)(0x6C000000 | 0x000007FE))	// A10 as RS
#define  LCD             ((LCD_TypeDef *) LCD_BASE)
#define  LCD_turnON_backlight	 (GPIO_backlight->BSRR = Bit(PIN_bl))		// set: output 1
#define  LCD_turnOFF_backlight (GPIO_backlight->BSRR = Bit(PIN_bl)<<16)		// reset: output 0
#define	 LCD_RESET_H  		(GPIO_reset->BSRR = Bit(PIN_rs))
#define	 LCD_RESET_L  		(GPIO_reset->BSRR = Bit(PIN_rs)<<16)
//<<<<<<<<<<<

#define LCD_WriteReg(x)	(LCD->LCD_REG = (uint16_t) x)	//lcd write reg
#define LCD_WriteData(x)	(LCD->LCD_RAM = (uint16_t) x)	//lcd write data
#define LCD_ReadData	((uint16_t) LCD->LCD_RAM)	//lcd read data

/********************************************************************************************************
// Display Inversion On & Off
// ILI9328 Code
********************************************************************************************************/
#define ReverseLCD()		LCD_WriteRegX(0x61, 0x0000)	// Display Inversion ON (21h)
#define NormalLCD()			LCD_WriteRegX(0x61, 0x0001)	// Display Inversion ON (21h)

/***********************************************
  * @brief  Configures the Parallel interface (FSMC) for LCD(Parallel mode)
  * @param  None
  * @retval None
  */
void LCD_FSMCConfig(void)
{
	FSMC_NORSRAM_InitTypeDef  hsram4_Init;
	FSMC_NORSRAM_TimingTypeDef wr_Timing, w_Timing;
	uint32_t FSMC_Bank1_NEx;
//	#define FSMC_NORSRAM_DEVICE                   FSMC_Bank1
//  #define FSMC_NORSRAM_EXTENDED_DEVICE 					FSMC_Bank1E
		FSMC_Bank1_NEx = ((LCD_BASE_sel>>26) & 0x03 )*2;	// for field of BCTR[(NEx-1)*2]
	// 0= NE1; 2= NE2; 4= NE3; 6= NE4 (=FSMC_NORSRAM_BANK4)
	
  /* Enable FSMC clock */
//  RCC_AHB3PeriphClockCmd(RCC_AHB3Periph_FSMC, ENABLE);
		RCC->AHB3ENR |= Bit(0); //bit 0: RCC_AHB3Periph_FSMC


/*-- FSMC Configuration ------------------------------------------------------*/
/*----------------------- SRAM Bank 1 ----------------------------------------*/
  /* FSMC_Bank1 NEx (x=1,..,4) configuration */
	/* Color LCD configuration ------------------------------------
     LCD (FSMC) configured as follow:
        - Data/Address MUX = Disable
        - Memory Type = SRAM
        - Data Width = 16bit //<<<<<============
        - Write Operation = Enable
        - Extended Mode = Disable
        - Asynchronous Wait = Disable */

//====================================
	hsram4_Init.PageSize  = 0;   // extraneous and useless field
//====================================

	hsram4_Init.NSBank = FSMC_Bank1_NEx; // for field of BCTR[(NEx-1)*2]
  hsram4_Init.DataAddressMux = FSMC_DATA_ADDRESS_MUX_DISABLE;
  hsram4_Init.MemoryType = FSMC_MEMORY_TYPE_SRAM;
  hsram4_Init.MemoryDataWidth = FSMC_NORSRAM_MEM_BUS_WIDTH_16;
  hsram4_Init.BurstAccessMode = FSMC_BURST_ACCESS_MODE_DISABLE;
  hsram4_Init.WaitSignalPolarity = FSMC_WAIT_SIGNAL_POLARITY_LOW;
  hsram4_Init.WrapMode = FSMC_WRAP_MODE_DISABLE;
  hsram4_Init.WaitSignalActive = FSMC_WAIT_TIMING_BEFORE_WS;
  hsram4_Init.WriteOperation = FSMC_WRITE_OPERATION_ENABLE;
  hsram4_Init.WaitSignal = FSMC_WAIT_SIGNAL_DISABLE;
  hsram4_Init.ExtendedMode = FSMC_EXTENDED_MODE_DISABLE;		// 0x00000000U
	//disable: Device->BWTR[Bank] = 0x0FFFFFFFU;  //Device=FSMC_Bank1e,
  hsram4_Init.AsynchronousWait = FSMC_ASYNCHRONOUS_WAIT_DISABLE;
  hsram4_Init.WriteBurst = FSMC_WRITE_BURST_DISABLE;

	wr_Timing.AddressSetupTime = 11;		// templet: 15
  wr_Timing.AddressHoldTime = 0;
  wr_Timing.DataSetupTime = 11;		// templet: 60
  wr_Timing.BusTurnAroundDuration = 0;
  wr_Timing.CLKDivision = 0;
  wr_Timing.DataLatency = 0;
  wr_Timing.AccessMode = FSMC_ACCESS_MODE_A;

  // Initialize SRAM control Interface BCTR[(NEx-1)*2]
  FSMC_NORSRAM_Init(FSMC_Bank1, &hsram4_Init);
	// FSMC_Bank1: FSMC Bank1 registers base address = 0xA0000000UL

  // Initialize SRAM timing Interface BCTR[(NEx-1)*2 + 1]
  FSMC_NORSRAM_Timing_Init(FSMC_Bank1, &wr_Timing, FSMC_Bank1_NEx); 

  if(hsram4_Init.ExtendedMode == FSMC_EXTENDED_MODE_ENABLE)
  {
		w_Timing.AddressSetupTime = 9;
		w_Timing.AddressHoldTime = 0;
		w_Timing.DataSetupTime = 8;
		w_Timing.BusTurnAroundDuration = 0;
		w_Timing.CLKDivision = 0;
		w_Timing.DataLatency = 0;
		w_Timing.AccessMode = FSMC_ACCESS_MODE_A;
  // Initialize SRAM extended mode timing Interface BWTR[(NEx-1)*2]
		FSMC_NORSRAM_Extended_Timing_Init(FSMC_Bank1E, &w_Timing, FSMC_Bank1_NEx,  FSMC_EXTENDED_MODE_ENABLE);  
  } else
	{
		    FSMC_Bank1E->BWTR[FSMC_Bank1_NEx] = 0x0FFFFFFFU;	// reset value
	}
  /* Enable FSMC NOR/SRAM Bank1 */
		__FSMC_NORSRAM_ENABLE(FSMC_Bank1, FSMC_Bank1_NEx); 
		//FSMC_Bank1->BTCR[FSMC_Bank1_NEx] |=  FSMC_BCR1_MBKEN;  // bit0: FSMC_BCR1_MBKEN;
}

/********************************************************************************************************
*  Function: GPIO_outPPhigh				                                                           
*  Object: set GPIO pin as output, push-pull, high speed (100 MHz)
*  Input: PortNum (0, ..., 6); PinNum (0, ..., 15)
*  Output: GPIO_x                                  
********************************************************************************************************/
static GPIO_TypeDef* GPIO_outPPhigh(uint32_t PortNum, uint32_t PinNum)
{
	GPIO_TypeDef *GPIO_x;
	uint32_t y=PinNum;

		RCC->AHB1ENR |=  (1UL << PortNum);     // enable clock for GPIOx
    // __SPI1_CS_PORT = 0: PORTA, 1: PORTB, ..., 10: PORTK
    GPIO_x  = (GPIO_TypeDef *)(AHB1PERIPH_BASE + 0x0400 * PortNum);

    GPIO_x->MODER   = (GPIO_x->MODER & ~Bit((y*2+1)) )  | Bit(y*2); //Output mode (01b)
    GPIO_x->OSPEEDR = (GPIO_x->OSPEEDR |  (0x03ul<<(y*2)) ); //high speed (11b)
    GPIO_x->OTYPER  &= ~Bit(y);                      // push-pull (0b)
    GPIO_x->PUPDR   &= ~(0x03ul<<(y*2));       //NO pull (00b)
  if (y < 8)
    GPIO_x->AFR[0]  &= ~(0x0Ful<<(y*4));      // AF0
  else
    GPIO_x->AFR[1]  &= ~(0x0Ful<<((y-8)*4));  // AF0
	
		return GPIO_x;
}

/********************************************************************************************************
*  Function: GPIO_AF12PPhigh				                                                           
*  Object: set GPIO pin as output, push-pull, high speed (100 MHz)
*  Input: PortNum (0, ..., 6); PinNum (0, ..., 15)
*  Output: none                                  
********************************************************************************************************/
static void GPIO_AF12PPhigh(uint32_t PortNum, uint32_t PinBit)
{
	GPIO_TypeDef *GPIO_x;
	uint32_t temp, chg1= PinBit, chg2=0, chg4L=0, chg4H=0;
	uint32_t fill2=0, fill4L=0, fill4H=0;

		RCC->AHB1ENR |=  (1UL << PortNum);     // enable clock for GPIOx
    // __SPI1_CS_PORT = 0: PORTA, 1: PORTB, ..., 10: PORTK
    GPIO_x  = (GPIO_TypeDef *)(AHB1PERIPH_BASE + 0x0400 * PortNum);

  
	for (temp=0; temp<16; temp++){
			if (PinBit & 0x01){
			   chg2 |= (0x03ul) << (temp*2);
			   fill2 |= (0x02ul) << (temp*2);
			  if (temp <8){
			   chg4L |= (0x0Ful) << (temp*4);
			   fill4L |= (0x0Cul) << (temp*4);
			  }else {
			   chg4H |= (0x0Ful) << ((temp-8)*4);
			   fill4H |= (0x0Cul) << ((temp-8)*4);
			  }				
		  }
			PinBit = PinBit >> 1;
	}

