GinoChen113511247/113_microcomputer/4_18_NEW_sample/GLCD/stm324xg_lcd_ILI9328_wizard.c
	LCD_OpenWin(Xpos, Ypos, Xpos+wf-1, Ypos+hf-1);
	byteNr =0;
	hp_limit = Ypos + hf;
	
  for(; Ypos < hp_limit; Ypos++)		// font height 
  {
		uint8_t as;

		as = c[byteNr++];
		iw = 0;
    for(jw = 0; jw < wf; jw++)	//  loop for the font width (wf)
    {
				if(as & (0x80))
				{
					LCD_WriteData(fColor);
				}
				else
				{
					LCD_WriteData(bColor);
				}
				as <<= 1;
				iw++;
				if (iw == 8){							// reach 1 byte = 8 bits
					as = c[byteNr++];
					iw = 0;
				}
    }
	}
}

/**
  * @brief  Displays characters between a line segment on the LCD.
  * @param  Xpos: X position (in pixel)
  * @param  Ypos: Y position (in pixel)   
  * @param  Text: Pointer to string to display on LCD
  * @retval None
  */
static void LCD_DisplayStringSegment(uint16_t Xpos, uint16_t Ypos, char *Text) //, uint16_t font_width)
{
	uint16_t fColor, bColor;
	
	// wf =: font_width,
	// hf =:  font_height
// 	font_width = pLCD_Currentfonts->Width  // wf = font_width
	fColor = DrawProp.TextColor;
	bColor = DrawProp.BackColor;
  while ((*Text != 0) & (Xpos  <= (LCD_PIXEL_WIDTH - (wf-1))) )
  {
    /* Display one character on LCD */
    LCD_DisplayChar(Xpos, Ypos, (uint8_t)*Text, fColor, bColor);
    /* Decrement the column position by 16 */
    Xpos += wf;
    /* Point on the next character */
    Text++;
  }
}

/**
  * @brief  Displays characters on the LCD.
  * @param  Xpos: X position (in pixel)
  * @param  Ypos: Y position (in pixel)   
  * @param  Text: Pointer to string to display on LCD
  * @param  Mode: Display mode
  *          This parameter can be one of the following values:
  *            @arg  CENTER_MODE
  *            @arg  RIGHT_MODE
  *            @arg  LEFT_MODE   
  * @retval None
  */
void LCD_DisplayStringAt(uint16_t Xpos, uint16_t Ypos, char *Text, Line_ModeTypdef Mode)
{
  uint32_t leftcolumn=0;
  uint32_t size = 0, xBlank=0; 
  char  *ptr = Text;
  
	// wf =: font_width,
	// hf =:  font_height
// 	font_width = pLCD_Currentfonts->Width  // wf = font_width
	if (Mode == LEFT_MODE){
				leftcolumn = Xpos;				
	} else
	{
 /* Get the text size */
		while (*ptr++) size ++ ;
  
  /* Characters number per line */
		xBlank = ((LCD_PIXEL_WIDTH+1) /wf);		// maximum number of characters per line
		if (size > xBlank){
			xBlank = 0;
		}	else {		
			xBlank = (xBlank - size)* wf;			
		}
		xBlank += (LCD_PIXEL_WIDTH+1) %wf;		// width of blank space of this string line
	}
		switch (Mode)
		{
		case LEFT_MODE:
			{
				break;
			}
		case CENTER_MODE:
			{
				leftcolumn = Xpos + xBlank/ 2;
				break;
			}
		case RIGHT_MODE:
			{
				// if leftcolumn = xBlank, the right border of the string is at the right side of the screen
				leftcolumn = LCD_PIXEL_WIDTH - Xpos;
				if (leftcolumn > xBlank){
					leftcolumn = 0;
				} else {
					leftcolumn = xBlank - leftcolumn;
				}
				break;
			}
		}
	
  /* Send the string character by character on LCD */
	LCD_DisplayStringSegment((uint16_t) leftcolumn, Ypos, Text);
}


/**
  * @brief  Displays the string on the required row and column
  * @param ount: specifies the delay time length (time base 10 ms).
  * @retval : None
  */
void LCD_DisplayStringLineCol(uint8_t LineNr, uint16_t ColNr, char *ptr)
{
  uint16_t Xpos, Ypos ;
	
	// wf =: font_width,
	// hf =:  font_height
	Xpos = ColNr * wf;
	Ypos = LineNr * hf;
	
	LCD_DisplayStringSegment(Xpos, Ypos, ptr);
}

/**
  * @brief  Draws a pixel on LCD.
  * @param  Xpos: X position 
  * @param  Ypos: Y position
  * @param  Color: Pixel color in RGB mode (5-6-5)  
  * @retval None
  */
void LCD_DrawPixel(uint16_t Xpos, uint16_t Ypos, uint16_t Color)
{
		LCD_OpenWin(Xpos, Ypos, Xpos, Ypos);
	  LCD_WriteData(Color);
}


/**
  * @brief  Draws a horizontal line on LCD.
  * @param  Xpos: X position 
  * @param  Ypos: Y position
  * @param  Length: line length
  * @param  RGB_Code: Pixel color in RGB mode (5-6-5)  
  * @retval None
  */
void LCD_DrawHLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length)
{
	uint16_t color=DrawProp.TextColor;
	uint16_t i, x1;

	if (Ypos > LCD_PIXEL_HEIGHT) return;
	x1 = Xpos+Length-1;
	if(x1 > LCD_PIXEL_WIDTH){
		x1 = LCD_PIXEL_WIDTH;
		Length = LCD_PIXEL_WIDTH - Xpos + 1;
	}
	LCD_OpenWin(Xpos, Ypos, x1, Ypos);
		for(i = 0; i < Length; i++)
			 LCD_WriteData(color);
}

/**
  * @brief  Draws a vertical line on LCD.
  * @param  Xcen: X position 
  * @param  Ypos: Y position
  * @param  Length: line length
  * @param  RGB_Code: Pixel color in RGB mode (5-6-5)  
  * @retval None
  */
void LCD_DrawVLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length)
{
	uint16_t color=DrawProp.TextColor;
	uint16_t j, y1;

	if (Xpos > LCD_PIXEL_WIDTH) return;
	y1 = Ypos+Length-1;
	if(y1 > LCD_PIXEL_HEIGHT){
		y1 = LCD_PIXEL_HEIGHT;
		Length = LCD_PIXEL_WIDTH - Xpos + 1;
	}
	LCD_OpenWin(Xpos, Ypos, Xpos, y1);
		for(j = 0; j < Length; j++)
			 LCD_WriteData(color);
}

/**
  * @brief  Draws a simple cross on LCD.
  * @param  Xcen: X center position 
  * @param  Ypos: Y center position
  * @param  Length: line length
  * @param  RGB_Code: Pixel color in RGB mode (5-6-5)  
  * @retval None
  */
void LCD_DrawSimpleCross(uint16_t Xpos, uint16_t Ypos, uint16_t Length)
{
	uint16_t hL;
	if ((Length & Bit(0)) == 0)		//even value
			Length +=1;
	
	hL = Length/2;
	LCD_DrawVLine(Xpos, Ypos-hL, Length);
	LCD_DrawHLine(Xpos-hL, Ypos, Length);
}

/**
  * @brief  Displays a rectangle border.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Height: display rectangle height.
  * @param  Width: display rectangle width.
  * @retval None
  */
void LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height)
{
	//===  vertical lines
  LCD_DrawVLine(Xpos, Ypos, Height);
  LCD_DrawVLine((Xpos + Width - 1), Ypos, Height);
	
	//===  horizontal lines
  LCD_DrawHLine(Xpos, Ypos, Width);
  LCD_DrawHLine(Xpos, (Ypos + Height-1), Width);
}

/**
  * @brief  Displays a circle border.
  * @param  Xcen: specifies the X position of the center.
  * @param  Ycen: specifies the Y position of the center.
  * @param  Radius
  * @retval None
  */
void LCD_DrawCircle(uint16_t Xcen, uint16_t Ycen, uint16_t Radius)
{
	uint16_t color=DrawProp.TextColor;

  int32_t  next;/* Decision Variable */
  uint16_t  Ri;/* increasing from 0 to Radius */
  uint16_t  Rd;/* decreasing from Radius to 0 */

  next = 3 - (Radius << 1);
  Ri = 0;
  Rd = Radius;
	
