GinoChen113511247/113_microcomputer/4_18_NEW_sample/GLCD/stm324xg_lcd_ILI9328_wizard.c
  while (Ri <= Rd)
  {
		int32_t x0, y0;

		x0 = Xcen -	Ri;
		y0 = Ycen -	Rd;
		if(x0<0) x0=0;
		if(y0<0) y0=0;
				LCD_DrawPixel((uint16_t)x0, (uint16_t)y0, color);                          
				LCD_DrawPixel((uint16_t)x0, Ycen+Rd, color);                  
				LCD_DrawPixel(Xcen+Ri, (uint16_t)y0, color);             
				LCD_DrawPixel(Xcen+Ri, Ycen+Rd, color);             
		x0 = Xcen -	Rd;
		y0 = Ycen -	Ri;
		if(x0<0) x0=0;
		if(y0<0) y0=0;
				LCD_DrawPixel((uint16_t)x0, (uint16_t)y0, color);              	         
				LCD_DrawPixel((uint16_t)x0, Ycen+Ri, color);             
				LCD_DrawPixel(Xcen+Rd, (uint16_t)y0, color);                      
				LCD_DrawPixel(Xcen+Rd, Ycen+Ri, color);                          

    if (next < 0)
    {
      next += (Ri << 2) + 6;
    }
    else
    {
      next += ((Ri - Rd) << 2) + 10;
      Rd--;
    }
    Ri++;
  }
}

/**
  * @brief  Displays a full rectangle with TestColor.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Height: rectangle height.
  * @param  Width: rectangle width.
  * @retval None
  */
void LCD_FillRect(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height)
{
	uint16_t color=DrawProp.TextColor;
	uint16_t Xend = Xpos+ Width-1, Yend = Ypos + Height-1;
	uint16_t i, j;
	
		LCD_OpenWin(Xpos, Ypos, Xend, Yend);
		for(i = 0; i < Width; i++)
			 for(j = 0; j < Height; j++)
					 LCD_WriteData(color);
	
}

/**
  * @brief  Displays a full circle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Radius
  * @retval None
  */
void LCD_FillCircle(uint16_t Xcen, uint16_t Ycen, uint16_t Radius)
{
//	uint16_t color=DrawProp.TextColor;
  int32_t  next;/* Decision Variable */
  uint16_t  Ri;/* increasing from 0 to Radius */
  uint16_t  Rd;/* decreasing from Radius to 0 */

  next = 3 - (Radius << 1);
  Ri = 0;
  Rd = Radius;

  while (Ri <= Rd)
  {
		int32_t X0, Y0;

		X0 = Xcen - Ri;
		Y0 = Ycen -	Rd;
		if(X0<0) X0=0;
		if(Y0<0) Y0=0;
		LCD_DrawVLine((uint16_t)X0, (uint16_t)Y0, (uint16_t)(Ycen + Rd - Y0));				// vertical line in landscape  view
		X0 = Xcen + Ri;
		LCD_DrawVLine((uint16_t)X0, (uint16_t)Y0, (uint16_t)(Ycen + Rd - Y0));				// vertical line in landscape  view
		X0 = Xcen - Rd;
		Y0 = Ycen -	Ri;
		if(X0<0) X0=0;
		if(Y0<0) Y0=0;
		LCD_DrawHLine((uint16_t)X0, (uint16_t)Y0, (uint16_t)(Xcen + Rd - X0));				// horizontal line in landscape  view
		Y0 = Ycen +	Ri;
		LCD_DrawHLine((uint16_t)X0, (uint16_t)Y0, (uint16_t)(Xcen + Rd - X0));				// horizontal line in landscape  view
    if (next < 0)
    {
      next += (Ri << 2) + 6;
    }
    else
    {
      next += ((Ri - Rd) << 2) + 10;
      Rd--;
    }
    Ri++;
  }
}

/**
  * @brief  Displays an uni-line (between two points).
  * @param  x1: specifies the point 1 x position.
  * @param  y1: specifies the point 1 y position.
  * @param  x2: specifies the point 2 x position.
  * @param  y2: specifies the point 2 y position.
  * @retval None
  */
void LCD_DrawLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
	uint16_t color=DrawProp.TextColor;
  int16_t deltax, deltay, x, y, xinc1, xinc2,
  yinc1 = 0, yinc2 = 0, den = 0, num = 0, numadd = 0, numpixels = 0,
  curpixel = 0;

  deltax = (int16_t)ABS(x2 - x1);        /* The difference between the x's */
  deltay = (int16_t)ABS(y2 - y1);        /* The difference between the y's */
  x = (int16_t)x1;                       /* Start x off at the first pixel */
  y = (int16_t)y1;                       /* Start y off at the first pixel */
	
  if (x2 >= x1)                 /* The x-values are increasing */
  {
    xinc1 = 1;
    xinc2 = 1;
  }
  else                          /* The x-values are decreasing */
  {
    xinc1 = -1;
    xinc2 = -1;
  }

  if (y2 >= y1)                 /* The y-values are increasing */
  {
    yinc1 = 1;
    yinc2 = 1;
  }
  else                          /* The y-values are decreasing */
  {
    yinc1 = -1;
    yinc2 = -1;
  }

  if (deltax >= deltay)         /* There is at least one x-value for every y-value */
  {
    xinc1 = 0;                  /* Don't change the x when numerator >= denominator */
    yinc2 = 0;                  /* Don't change the y for every iteration */
    den = deltax;
    num = deltax / 2;
    numadd = deltay;
    numpixels = deltax;         /* There are more x-values than y-values */
  }
  else                          /* There is at least one y-value for every x-value */
  {
    xinc2 = 0;                  /* Don't change the x for every iteration */
    yinc1 = 0;                  /* Don't change the y when numerator >= denominator */
    den = deltay;
    num = deltay / 2;
    numadd = deltax;
    numpixels = deltay;         /* There are more y-values than x-values */
  }

  for (curpixel = 0; curpixel <= numpixels; curpixel++)
  {
		if(x < 0 || x > LCD_PIXEL_WIDTH || y < 0 || y > LCD_PIXEL_HEIGHT)
		{
			goto escape;
		}
		LCD_DrawPixel((uint16_t)x, (uint16_t)y, color);
escape:
    num += numadd;              /* Increase the numerator by the top of the fraction */
    if (num >= den)             /* Check if numerator >= denominator */
    {
      num -= den;               /* Calculate the new numerator value */
      x += xinc1;               /* Change the x as appropriate */
      y += yinc1;               /* Change the y as appropriate */
    }
    x += xinc2;                 /* Change the x as appropriate */
    y += yinc2;                 /* Change the y as appropriate */
  }
}

/**
  * @brief  Displays a mono-color picture.
  * @param  Pict: pointer to the picture array.
  * @retval None
  */
void LCD_DrawMonoPict(const uint32_t *Pict)
{
	uint16_t fcolor=DrawProp.TextColor;
	uint16_t bcolor=DrawProp.BackColor;
  uint32_t index = 0, i = 0;

  LCD_OpenWin(0, 0, LCD_PIXEL_WIDTH, LCD_PIXEL_HEIGHT);
//  LCD_SetCursor(0, LCD_PIXEL_WIDTH );
//  LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
 
	for(index = 0; index < 2400; index++)
  {
    for(i = 0; i < 32; i++)						// 2400 x 32 = 240 x 320
    {
      if((Pict[index] & (1 << i)) == 0x00)
      {
        LCD_WriteData(bcolor);		// background color
      }
      else
      {
        LCD_WriteData(fcolor);
      }
    }
  }
}

/**
  * @brief  Draws a bitmap picture (16 bpp) (24 bpp will be transfered to 16 bpp automatically).
  * @param  Xpos: Bmp X position in the LCD
  * @param  Ypos: Bmp Y position in the LCD
  * @param  pbmp: Pointer to Bmp picture address.
  * @retval None
  */
void LCD_DrawBitmap(uint16_t x0, uint16_t y0, uint8_t *BmpAddress)	
{
  uint32_t index;
  uint16_t bitCount;
  uint16_t X0, Y0;
	
	uint32_t height, i, n;
  uint32_t width, j, j_ignore;
  
  //---------------->>>>>>>>>>>>>>>
	/* Read BMP signature */
  width = *(uint16_t *) (BmpAddress + 0);		// get 2-Bytes value
	if (width != 0x4D42) return;
	
  /* Read bitmap width */
  width = *(uint16_t *) (BmpAddress + 18);
  width |= (uint32_t) (*(uint16_t *) (BmpAddress + 20)) << 16;
  
  /* Read bitmap height */
  height = *(uint16_t *) (BmpAddress + 22);
  height |= (uint32_t) (*(uint16_t *) (BmpAddress + 24)) << 16; 

	//-----------------<<<<<<<<<<<<<<<<<<<<<
  
  /* Read number of bits per pixel */
  bitCount = *(uint16_t *) (BmpAddress + 28);

  /* Read bitmap size */
  /* Get bitmap data address offset */
  index = *(__IO uint16_t *) (BmpAddress + 10);
  index |= (uint32_t) (*(__IO uint16_t *) (BmpAddress + 12)) << 16;
  BmpAddress += index;
	
//>>>######################################################
  /* Set GRAM write direction and BGR = 1 (ILI9328) */
	// ########## For Landscape A #############
// bit: 5  4  3 
		//ID1/ID0 AM   FUNCTION
		// 0  0   1	   D->U	(R->L)
		LCD_WriteReg(0x0003);  // GRAM Mode (03h)
  #if (LANDSCAPE == 1)
	  uint16_t tmp;
		tmp = GRAM_mode & ~(Bit(4)|Bit(5));			// I/D = 00b
    /* BMP updates from bottom to top and left to right        */
		LCD_WriteData(tmp);	
		//   column (y) 
		// L   ^
		//     |
		//     |
		//     |(x0,y1)  
		// R,D  --------------------> U, page (x)
		// 
		// (x0,y1) ==>  X0 = y1; Y0 = LCD_PIXEL_WIDTH - x0
  #else
	// ########## For Portrait A #############
// bit: 5  4  3 
		//ID1/ID0 AM   FUNCTION
		// 1  0   0	   R->L (U->D)
	  uint16_t tmp;
		tmp = (GRAM_mode & ~(Bit(4)|Bit(5)) ) | Bit(5);			// I/D = 10b
		LCD_WriteData(tmp);
		//   column (x) 
		// L   ^
		//     |
		//     |                   (x0,y1)
		// R,D  <-------------------- U, page (y)
		//
		// (x0,y1) ==>  X0 = LCD_PIXEL_WIDTH - x0; Y0 = LCD_PIXEL_HEIGHT - y1
  #endif
//<<<######################################
//>>>>>########### revised on 2024.08.01 ###############################
//	LCD_DisplayWindow_WnH(Xpos, Ypos, width, height);
	i = y0 + height - 1;			// y1
	n = 0;
	if (i > LCD_PIXEL_HEIGHT){
		n = i - LCD_PIXEL_HEIGHT;			// ignore the image part on the last "n" lines
		i = LCD_PIXEL_HEIGHT;			// y1
	}
	j = x0 + width - 1;			// x1
	j_ignore = width;
	if (j > LCD_PIXEL_WIDTH){
		if (x0 > LCD_PIXEL_WIDTH) j_ignore = 0;
		else j_ignore = (LCD_PIXEL_WIDTH+1) - x0;
		j = LCD_PIXEL_WIDTH;		// x1
	}
	
	LCD_OpenWin(x0, y0, (uint16_t)j, (uint16_t)i);
	
#if (LANDSCAPE == 1)
		X0 = (uint16_t)i; 	// i = y1;
		Y0 = LCD_PIXEL_WIDTH - x0;
#else
		X0 = LCD_PIXEL_WIDTH - x0;
		Y0 = LCD_PIXEL_HEIGHT - i; 	// i = y1;
#endif
		LCD_WriteReg(0x20);				// set cursor X 
		LCD_WriteData(X0);
		LCD_WriteReg(0x21);				// set cursor Y 
		LCD_WriteData(Y0);
		LCD_WriteReg(0x22);				// Write Data to GRAM (R22h) 
	
//<<<<<########### revised on 2024.08.01 ###############################

  if (bitCount == 24)
	{
		uint8_t skip;
		uint16_t n_ignore = (uint16_t) (width - j_ignore);		//#### revised on 2024.08.01
		
		skip = 0x03 & (4 - ( (width*3) &0x03));   // align in 4 multiple
		if (n > 0){																// ignore "n" lines
			BmpAddress += n * (3*width + skip);					//#### revised on 2024.08.01
		}
			
		for (i = n; i<height; i++)				
		{ 
			for (j=0; j<j_ignore; j++)	//#### revised on 2024.08.01
			{
				uint16_t temp;
/*				uint16_t t2;
				t2 = (*(__IO uint8_t *)BmpAddress++);
				temp = t2 >>3;
				t2 = (*(__IO uint8_t *)(BmpAddress++));
				temp |= (t2 >>3)<<6;
				t2 = (*(__IO uint8_t *)(BmpAddress++));
				temp |= (t2 >>3)<<(5+6);
*/
					temp = (*(__IO uint8_t *)BmpAddress++)>>3;
					temp |= ((*(__IO uint8_t *)(BmpAddress++) )>> 3)  << 6;
					temp |= ((*(__IO uint8_t *) (BmpAddress++) )>> 3)  << (6+5);
					LCD_WriteData(temp);
			}
			BmpAddress += 3*n_ignore;					//#### revised on 2024.08.01
			BmpAddress += skip;
		}
	}
	else // bitCount == 16 [RED (5bits): GREEN (6bits): BLUE (5bits)]
	{
//>>>>>########### revised on 2024.08.01 ###############################
		uint16_t n_ignore = (uint16_t) (width - j_ignore);		

		if (n > 0){				// ignore "n" lines		
			BmpAddress += n * (2*width);
		}
		
		for (i = n; i<height; i++)				
		{ 
			for (j=0; j<j_ignore; j++)	//#### revised on 2024.08.01
			{
				LCD_WriteData(*(__IO uint16_t *)BmpAddress);
				BmpAddress += 2;
			}
			BmpAddress += 2 * n_ignore;					//#### revised on 2024.08.01
		}
//<<<<<########### revised on 2024.08.01 ###############################
  }

//>>>######################################################
  /* Set GRAM write direction and BGR = 1 (ILI9428) */
		LCD_WriteRegX(0x0003, GRAM_mode);  // GRAM Mode 
//<<<######################################
}

/**
  * @brief  Draws RGB Image (16 bpp).
  * @param  Xpos:  X position in the LCD
  * @param  Ypos:  Y position in the LCD
  * @param  Xsize: X size in the LCD
  * @param  Ysize: Y size in the LCD
  * @param  pdata: Pointer to the RGB Image address.
  * @retval None
  */
void LCD_DrawRGBImage(uint16_t Xpos, uint16_t Ypos, uint16_t Xsize, uint16_t Ysize, uint8_t *pdata)
{
  uint16_t x1, y1;
  uint16_t i, j;
  
	if ( (Xpos > LCD_PIXEL_WIDTH) || (Ypos > LCD_PIXEL_HEIGHT)) return;
	x1 = Xpos + Xsize-1;
	y1 = Ypos + Ysize-1;
	if (x1 > LCD_PIXEL_WIDTH) Xsize = LCD_PIXEL_WIDTH+1 - Xpos;
	if (y1 > LCD_PIXEL_HEIGHT) Ysize = LCD_PIXEL_HEIGHT+1 - Ypos;
  
